run/case_laminar/system/blockMeshDict
 /*--------------------------------*- C++ -*------------------------------*\\
 | =========                  |                                             |
 | \\      /   F ield         | OpenFOAM: The Open Source CFD Toolbox       |
 |  \\    /    O peration     | Version*: 1.6                               |
 |   \\  /     A nd           | Web:      http://www.OpenFOAM.org           |
 |    \\/      M anipulation  |                                             |
 \\*-----------------------------------------------------------------------*/
   FoamFile
   {
      version 2.0;
      format ascii;
      class dictionary;
      object blockMeshDict;
   }
 
  //* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
 
convertToMeters 1.00;
 
 vertices
 (
  ( -10.0000  -5.0000   0.00  )  //Pt 0
  (  -0.4000  -5.0000   0.00 )
  (  -0.1036  -5.0000   0.00 )
  (   0.5173  -5.0000   0.00 )
  (   0.9141  -5.0000   0.00 )
  (   5.0000  -5.0000   0.00  )  //Pt 5
  ( -10.0000  -0.1711   0.00 )
  (  -0.4000  -0.1711   0.00 )
  (  -0.1036  -0.1711   0.00 )
  (   0.5173  -0.2090   0.00 )
  (   0.9141  -0.1702   0.00 )  //Pt 10
  (   5.0000  -0.1702   0.00 )
  ( -10.0000   0.0000   0.00 )
  (  -0.4000   0.0000   0.00 )
  (   0.0000   0.0000   0.00 )
  (   0.5125  -0.0091   0.00 )  //Pt 15
  (   0.8730   0.0255   0.00 )
  (   0.9929   0.0911   0.00 )
  (   1.1929   0.0911   0.00 )
  (   5.0000   0.0911   0.00 )
  ( -10.0000   0.1593   0.00 )  //Pt 20
  (  -0.4000   0.1593   0.00 )
  (  -0.1210   0.1593   0.00 )
  (   0.5031   0.0979   0.00 )
  (   0.9216   0.1214   0.00 )
  (   0.4743   0.2958   0.00 )  //Pt 25
  (   0.9538   0.3188   0.00 )
  (   5.0000   0.3188   0.00 )
  ( -10.0000   5.0000   0.00 )
  (  -0.4000   5.0000   0.00 )
  (  -0.1210   5.0000   0.00 )
  (   0.4743   5.0000   0.00 )
  (   0.9538   5.0000   0.00 )
  (   5.0000   5.0000   0.00 )
  ( -10.0000  -5.0000   0.10  )  //Pt 0
  (  -0.4000  -5.0000   0.10 )
  (  -0.1036  -5.0000   0.10 )
  (   0.5173  -5.0000   0.10 )
  (   0.9141  -5.0000   0.10 )
  (   5.0000  -5.0000   0.10  )  //Pt 5
  ( -10.0000  -0.1711   0.10 )
  (  -0.4000  -0.1711   0.10 )
  (  -0.1036  -0.1711   0.10 )
  (   0.5173  -0.2090   0.10 )
  (   0.9141  -0.1702   0.10 )  //Pt 10
  (   5.0000  -0.1702   0.10 )
  ( -10.0000   0.0000   0.10 )
  (  -0.4000   0.0000   0.10 )
  (   0.0000   0.0000   0.10 )
  (   0.5125  -0.0091   0.10 )  //Pt 15
  (   0.8730   0.0255   0.10 )
  (   0.9929   0.0911   0.10 )
  (   1.1929   0.0911   0.10 )
  (   5.0000   0.0911   0.10 )
  ( -10.0000   0.1593   0.10 )  //Pt 20
  (  -0.4000   0.1593   0.10 )
  (  -0.1210   0.1593   0.10 )
  (   0.5031   0.0979   0.10 )
  (   0.9216   0.1214   0.10 )
  (   0.4743   0.2958   0.10 )  //Pt 25
  (   0.9538   0.3188   0.10 )
  (   5.0000   0.3188   0.10 )
  ( -10.0000   5.0000   0.10 )
  (  -0.4000   5.0000   0.10 )
  (  -0.1210   5.0000   0.10 )
  (   0.4743   5.0000   0.10 )
  (   0.9538   5.0000   0.10 )
  (   5.0000   5.0000   0.10 )
 );
 
 blocks
 (
  hex ( 20 21 29 28 54 55 63 62) turbulent (120 60 1) simpleGrading ( 0.05 25.00  1)
  hex ( 21 22 30 29 55 56 64 63) turbulent (50 60 1) simpleGrading ( 0.30 25.00  1)
  hex ( 22 25 31 30 56 59 65 64) turbulent (60 60 1) simpleGrading ( 4.00 25.00  1)
  hex ( 25 26 32 31 59 60 66 65) laminar (60 60 1) simpleGrading ( 0.20 25.00  1)
  hex ( 26 27 33 32 60 61 67 66) laminar (100 60 1) simpleGrading (15.00 25.00  1)
  hex ( 18 19 27 26 52 53 61 60) laminar (100 60 1) simpleGrading (15.00  3.00  1)
  hex ( 10 11 19 18 44 45 53 52) laminar (100 80 1) simpleGrading (15.00  0.40  1)
  hex (  4  5 11 10 38 39 45 44) laminar (100 60 1) simpleGrading (15.00  0.03  1)
  hex (  3  4 10  9 37 38 44 43) laminar (50 60 1) simpleGrading ( 0.20  0.03  1)
  hex (  2  3  9  8 36 37 43 42) turbulent (50 60 1) simpleGrading ( 3.00  0.03  1)
  hex (  1  2  8  7 35 36 42 41) turbulent (50 60 1) simpleGrading ( 0.30  0.03  1)
  hex (  0  1  7  6 34 35 41 40) turbulent (120 60 1) simpleGrading ( 0.05  0.03  1)
  hex (  6  7 13 12 40 41 47 46) turbulent (120 70 1) simpleGrading ( 0.05  0.10  1)
  hex ( 12 13 21 20 46 47 55 54) turbulent (120 70 1) simpleGrading ( 0.05 10.00  1)
  hex ( 13 14 22 21 47 48 56 55) turbulent (50 70 1) simpleGrading ( 0.30 10.00  1)
  hex ( 14 23 25 22 48 57 59 56) turbulent (60 70 1) simpleGrading ( 4.00 10.00  1)
  hex ( 23 24 26 25 57 58 60 59) laminar (60 70 1) simpleGrading ( 0.20 10.00  1)
  hex ( 17 18 26 24 51 52 60 58) laminar (70 60 1) simpleGrading (10.00  3.00  1)
  hex ( 16 10 18 17 50 44 52 51) laminar (70 80 1) simpleGrading (10.00  0.40  1)
  hex (  9 10 16 15 43 44 50 49) laminar (50 70 1) simpleGrading ( 0.20  0.10  1)
  hex (  8  9 15 14 42 43 49 48) turbulent (50 70 1) simpleGrading ( 3.00  0.10  1)
  hex (  7  8 14 13 41 42 48 47) turbulent (50 70 1) simpleGrading ( 0.30  0.10  1)
 );
 
 edges
 (
      polyLine 14 23 (
          ( 0.0022  0.0018  0.0000 )
          ( 0.0027  0.0022  0.0000 )
          ( 0.0067  0.0032  0.0000 )
          ( 0.0119  0.0043  0.0000 )
          ( 0.0181  0.0058  0.0000 )
          ( 0.0255  0.0074  0.0000 )
          ( 0.0339  0.0093  0.0000 )
          ( 0.0434  0.0114  0.0000 )
          ( 0.0539  0.0138  0.0000 )
          ( 0.0655  0.0163  0.0000 )
          ( 0.0781  0.0191  0.0000 )
          ( 0.0916  0.0220  0.0000 )
          ( 0.1060  0.0251  0.0000 )
          ( 0.1214  0.0283  0.0000 )
          ( 0.1376  0.0317  0.0000 )
          ( 0.1547  0.0352  0.0000 )
          ( 0.1725  0.0389  0.0000 )
          ( 0.1911  0.0427  0.0000 )
          ( 0.2104  0.0465  0.0000 )
          ( 0.2303  0.0504  0.0000 )
          ( 0.2509  0.0544  0.0000 )
          ( 0.2720  0.0584  0.0000 )
          ( 0.2937  0.0625  0.0000 )
          ( 0.3158  0.0666  0.0000 )
          ( 0.3383  0.0707  0.0000 )
          ( 0.3612  0.0747  0.0000 )
          ( 0.3844  0.0788  0.0000 )
          ( 0.4078  0.0828  0.0000 )
          ( 0.4315  0.0867  0.0000 )
          ( 0.4553  0.0905  0.0000 )
          ( 0.4792  0.0943  0.0000 )
        )
      polyLine 23 24 (
          ( 0.5271  0.1014  0.0000 )
          ( 0.5509  0.1047  0.0000 )
          ( 0.5746  0.1079  0.0000 )
          ( 0.5982  0.1109  0.0000 )
          ( 0.6215  0.1136  0.0000 )
          ( 0.6445  0.1162  0.0000 )
          ( 0.6672  0.1185  0.0000 )
          ( 0.6895  0.1206  0.0000 )
          ( 0.7113  0.1224  0.0000 )
          ( 0.7326  0.1239  0.0000 )
          ( 0.7534  0.1252  0.0000 )
          ( 0.7737  0.1261  0.0000 )
          ( 0.7932  0.1268  0.0000 )
          ( 0.8121  0.1271  0.0000 )
          ( 0.8302  0.1272  0.0000 )
          ( 0.8476  0.1270  0.0000 )
          ( 0.8642  0.1265  0.0000 )
          ( 0.8799  0.1256  0.0000 )
          ( 0.8947  0.1245  0.0000 )
          ( 0.9086  0.1231  0.0000 )
        )
      polyLine 24 17 (
          ( 0.9335  0.1195  0.0000 )
          ( 0.9445  0.1172  0.0000 )
          ( 0.9544  0.1148  0.0000 )
          ( 0.9632  0.1121  0.0000 )
          ( 0.9710  0.1091  0.0000 )
          ( 0.9776  0.1059  0.0000 )
          ( 0.9832  0.1025  0.0000 )
          ( 0.9876  0.0989  0.0000 )
          ( 0.9908  0.0951  0.0000 )
        )
      polyLine 17 16 (
          ( 0.9923  0.0784  0.0000 )
          ( 0.9897  0.0740  0.0000 )
          ( 0.9860  0.0697  0.0000 )
          ( 0.9812  0.0654  0.0000 )
          ( 0.9752  0.0612  0.0000 )
          ( 0.9680  0.0569  0.0000 )
          ( 0.9598  0.0527  0.0000 )
          ( 0.9505  0.0485  0.0000 )
          ( 0.9401  0.0445  0.0000 )
          ( 0.9287  0.0405  0.0000 )
          ( 0.9162  0.0366  0.0000 )
          ( 0.9028  0.0328  0.0000 )
          ( 0.8883  0.0291  0.0000 )
        )
      polyLine 16 15 (
          ( 0.8568  0.0221  0.0000 )
          ( 0.8397  0.0189  0.0000 )
          ( 0.8218  0.0158  0.0000 )
          ( 0.8032  0.0129  0.0000 )
          ( 0.7838  0.0101  0.0000 )
          ( 0.7637  0.0076  0.0000 )
          ( 0.7430  0.0052  0.0000 )
          ( 0.7217  0.0030  0.0000 )
          ( 0.6999  0.0010  0.0000 )
          ( 0.6776 -0.0008  0.0000 )
          ( 0.6549 -0.0025  0.0000 )
          ( 0.6318 -0.0040  0.0000 )
          ( 0.6083 -0.0053  0.0000 )
          ( 0.5846 -0.0065  0.0000 )
          ( 0.5607 -0.0075  0.0000 )
          ( 0.5367 -0.0083  0.0000 )
        )
      polyLine 15 14 (
          ( 0.5125 -0.0091  0.0000 )
          ( 0.4883 -0.0096  0.0000 )
          ( 0.4641 -0.0101  0.0000 )
          ( 0.4400 -0.0105  0.0000 )
          ( 0.4160 -0.0107  0.0000 )
          ( 0.3922 -0.0108  0.0000 )
          ( 0.3687 -0.0109  0.0000 )
          ( 0.3454 -0.0109  0.0000 )
          ( 0.3225 -0.0107  0.0000 )
          ( 0.3000 -0.0106  0.0000 )
          ( 0.2780 -0.0103  0.0000 )
          ( 0.2565 -0.0100  0.0000 )
          ( 0.2356 -0.0097  0.0000 )
          ( 0.2153 -0.0093  0.0000 )
          ( 0.1956 -0.0088  0.0000 )
          ( 0.1766 -0.0084  0.0000 )
          ( 0.1584 -0.0079  0.0000 )
          ( 0.1410 -0.0073  0.0000 )
          ( 0.1245 -0.0068  0.0000 )
          ( 0.1088 -0.0063  0.0000 )
          ( 0.0940 -0.0057  0.0000 )
          ( 0.0802 -0.0052  0.0000 )
          ( 0.0673 -0.0047  0.0000 )
          ( 0.0555 -0.0042  0.0000 )
          ( 0.0447 -0.0037  0.0000 )
          ( 0.0350 -0.0033  0.0000 )
          ( 0.0264 -0.0029  0.0000 )
          ( 0.0188 -0.0025  0.0000 )
          ( 0.0124 -0.0022  0.0000 )
          ( 0.0072 -0.0019  0.0000 )
          ( 0.0031 -0.0017  0.0000 )
          ( 0.0025 -0.0014  0.0000 )
        )
      polyLine 48 57 (
          ( 0.0022  0.0018  0.1000 )
          ( 0.0027  0.0022  0.1000 )
          ( 0.0067  0.0032  0.1000 )
          ( 0.0119  0.0043  0.1000 )
          ( 0.0181  0.0058  0.1000 )
          ( 0.0255  0.0074  0.1000 )
          ( 0.0339  0.0093  0.1000 )
          ( 0.0434  0.0114  0.1000 )
          ( 0.0539  0.0138  0.1000 )
          ( 0.0655  0.0163  0.1000 )
          ( 0.0781  0.0191  0.1000 )
          ( 0.0916  0.0220  0.1000 )
          ( 0.1060  0.0251  0.1000 )
          ( 0.1214  0.0283  0.1000 )
          ( 0.1376  0.0317  0.1000 )
          ( 0.1547  0.0352  0.1000 )
          ( 0.1725  0.0389  0.1000 )
          ( 0.1911  0.0427  0.1000 )
          ( 0.2104  0.0465  0.1000 )
          ( 0.2303  0.0504  0.1000 )
          ( 0.2509  0.0544  0.1000 )
          ( 0.2720  0.0584  0.1000 )
          ( 0.2937  0.0625  0.1000 )
          ( 0.3158  0.0666  0.1000 )
          ( 0.3383  0.0707  0.1000 )
          ( 0.3612  0.0747  0.1000 )
          ( 0.3844  0.0788  0.1000 )
          ( 0.4078  0.0828  0.1000 )
          ( 0.4315  0.0867  0.1000 )
          ( 0.4553  0.0905  0.1000 )
          ( 0.4792  0.0943  0.1000 )
        )
      polyLine 57 58 (
          ( 0.5271  0.1014  0.1000 )
          ( 0.5509  0.1047  0.1000 )
          ( 0.5746  0.1079  0.1000 )
          ( 0.5982  0.1109  0.1000 )
          ( 0.6215  0.1136  0.1000 )
          ( 0.6445  0.1162  0.1000 )
          ( 0.6672  0.1185  0.1000 )
          ( 0.6895  0.1206  0.1000 )
          ( 0.7113  0.1224  0.1000 )
          ( 0.7326  0.1239  0.1000 )
          ( 0.7534  0.1252  0.1000 )
          ( 0.7737  0.1261  0.1000 )
          ( 0.7932  0.1268  0.1000 )
          ( 0.8121  0.1271  0.1000 )
          ( 0.8302  0.1272  0.1000 )
          ( 0.8476  0.1270  0.1000 )
          ( 0.8642  0.1265  0.1000 )
          ( 0.8799  0.1256  0.1000 )
          ( 0.8947  0.1245  0.1000 )
          ( 0.9086  0.1231  0.1000 )
        )
      polyLine 58 51 (
          ( 0.9335  0.1195  0.1000 )
          ( 0.9445  0.1172  0.1000 )
          ( 0.9544  0.1148  0.1000 )
          ( 0.9632  0.1121  0.1000 )
          ( 0.9710  0.1091  0.1000 )
          ( 0.9776  0.1059  0.1000 )
          ( 0.9832  0.1025  0.1000 )
          ( 0.9876  0.0989  0.1000 )
          ( 0.9908  0.0951  0.1000 )
        )
      polyLine 51 50 (
          ( 0.9923  0.0784  0.1000 )
          ( 0.9897  0.0740  0.1000 )
          ( 0.9860  0.0697  0.1000 )
          ( 0.9812  0.0654  0.1000 )
          ( 0.9752  0.0612  0.1000 )
          ( 0.9680  0.0569  0.1000 )
          ( 0.9598  0.0527  0.1000 )
          ( 0.9505  0.0485  0.1000 )
          ( 0.9401  0.0445  0.1000 )
          ( 0.9287  0.0405  0.1000 )
          ( 0.9162  0.0366  0.1000 )
          ( 0.9028  0.0328  0.1000 )
          ( 0.8883  0.0291  0.1000 )
        )
      polyLine 50 49 (
          ( 0.8568  0.0221  0.1000 )
          ( 0.8397  0.0189  0.1000 )
          ( 0.8218  0.0158  0.1000 )
          ( 0.8032  0.0129  0.1000 )
          ( 0.7838  0.0101  0.1000 )
          ( 0.7637  0.0076  0.1000 )
          ( 0.7430  0.0052  0.1000 )
          ( 0.7217  0.0030  0.1000 )
          ( 0.6999  0.0010  0.1000 )
          ( 0.6776 -0.0008  0.1000 )
          ( 0.6549 -0.0025  0.1000 )
          ( 0.6318 -0.0040  0.1000 )
          ( 0.6083 -0.0053  0.1000 )
          ( 0.5846 -0.0065  0.1000 )
          ( 0.5607 -0.0075  0.1000 )
          ( 0.5367 -0.0083  0.1000 )
        )
      polyLine 49 48 (
          ( 0.5125 -0.0091  0.1000 )
          ( 0.4883 -0.0096  0.1000 )
          ( 0.4641 -0.0101  0.1000 )
          ( 0.4400 -0.0105  0.1000 )
          ( 0.4160 -0.0107  0.1000 )
          ( 0.3922 -0.0108  0.1000 )
          ( 0.3687 -0.0109  0.1000 )
          ( 0.3454 -0.0109  0.1000 )
          ( 0.3225 -0.0107  0.1000 )
          ( 0.3000 -0.0106  0.1000 )
          ( 0.2780 -0.0103  0.1000 )
          ( 0.2565 -0.0100  0.1000 )
          ( 0.2356 -0.0097  0.1000 )
          ( 0.2153 -0.0093  0.1000 )
          ( 0.1956 -0.0088  0.1000 )
          ( 0.1766 -0.0084  0.1000 )
          ( 0.1584 -0.0079  0.1000 )
          ( 0.1410 -0.0073  0.1000 )
          ( 0.1245 -0.0068  0.1000 )
          ( 0.1088 -0.0063  0.1000 )
          ( 0.0940 -0.0057  0.1000 )
          ( 0.0802 -0.0052  0.1000 )
          ( 0.0673 -0.0047  0.1000 )
          ( 0.0555 -0.0042  0.1000 )
          ( 0.0447 -0.0037  0.1000 )
          ( 0.0350 -0.0033  0.1000 )
          ( 0.0264 -0.0029  0.1000 )
          ( 0.0188 -0.0025  0.1000 )
          ( 0.0124 -0.0022  0.1000 )
          ( 0.0072 -0.0019  0.1000 )
          ( 0.0031 -0.0017  0.1000 )
          ( 0.0025 -0.0014  0.1000 )
        )
 );
 
 patches
 (
       wall top
     (
      ( 28 29 63 62)
      ( 29 30 64 63)
      ( 30 31 65 64)
      ( 31 32 66 65)
      ( 32 33 67 66)
     )
    patch inlet
     (
      ( 67 33 27 61)
      ( 61 27 19 53)
      ( 53 19 11 45)
      ( 45 11  5 39)
     )
    wall bottom
     (
      (  0 34 35  1)
      (  1 35 36  2)
      (  2 36 37  3)
      (  3 37 38  4)
      (  4 38 39  5)
     )
   patch outlet
     (
      ( 28 62 54 20)
      ( 20 54 46 12)
      ( 12 46 40  6)
      (  6 40 34  0)
     )
      wall wing
     (
      ( 14 48 57 23)
      ( 23 57 58 24)
      ( 24 58 51 17)
      ( 16 17 51 50)
      ( 15 16 50 49)
      ( 14 15 49 48)
     )
 );
 
 mergePatchPairs
 (
 );
 
  //* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
